// import 'package:flutter/material.dart';

import './models/kpop.dart';
import './models/member.dart';

const DUMMY_KPOPS = const [
  Kpops(
    kpopID: 'BP',
    kpopname: 'BLΛƆKPIИK',
    img: 'https://static.billboard.com/files/media/izx4xs-Blackpink-8znak-bb05-nz7w-2019-feat-billboard-cdakjehr-jxs8xjkx-1548-1024x677.jpg',
    detail: '\r\r\r\r\rแบล็กพิงก์ (เกาหลี: 블랙핑크; อังกฤษ: Black Pink, มักเขียน BLACKPINK หรือ BLΛƆKPIИK) เป็นเกิร์ลกรุปเกาหลีใต้ สังกัดค่ายวายจีเอนเตอร์เทนเมนต์ ประกอบด้วยสมาชิกจำนวนสี่คนคือ จีซู, เจนนี, โรเซ และ​ ลิซ่า เปิดตัวครั้งแรกเมื่อวันที่ 8 สิงหาคม ค.ศ. 2016 กับซิงเกิลอัลบั้ม สแควร์วัน หลังจากวางจำหน่าย ซิงเกิล "วิสเซิล" กลายเป็นเพลงแรกของวงที่ขึ้นอันดับ 1 บนแกออนดิจิทัลชาร์ต เช่นเดียวกับซิงเกิล "บูมบายาห์" กลายเป็นเพลงแรกที่ติดอันดับหนึ่งบนชาร์ตบิลบอร์ด เวิลด์ดิจิทัลซองส์ วงยังได้รับรางวัลโกลเดนดิสก์อะวอดส์และโซลมิวสิกอะวอดส์สาขาศิลปินหน้าใหม่แห่งปี \n\r\r\r\r\rในปี ค.ศ. 2019 แบล็กพิงก์ทำสถิติเป็นเกิร์ลกรุปเคป็อปที่ได้อันดับสูงสุดทั้งบน บิลบอร์ด ฮอต 100 และ บิลบอร์ด 200 เพลง "คิลดิสเลิฟ" ขึ้นถึงอันดับที่ 41 และอันดับที่ 24 ด้วยอีพีชุดที่สองของวง คิลดิสเลิฟ ตามลำดับ รวมถึงเป็นเกิร์ลกรุปเคป็อปวงแรกและวงเดียวที่ขึ้นอันดับหนึ่งบนชาร์ต บิลบอร์ด ประเภทศิลปินหน้าใหม่ และเป็นศิลปินหญิงกลุ่มแรกที่มีซิงเกิลอันดับหนึ่งของชาร์ตบิลบอร์ด เวิลด์ดิจิทัลซองส์ ถึง 5 เพลง ซิงเกิล "ตู-ดู ตู-ดู" กลายเป็นมิวสิกวิดีโอที่มียอดเข้าชมมากที่สุดของศิลปินกลุ่มเคป็อปทั้งหมด โดยมียอดเข้าชมมากกว่า 1 พันล้านครั้งในยูทูบ',
    color1: '0xFFF06292',
    color2: '0xFF000000',
    // color1: Colors.pinkAccent,
    // color2: Colors.black
  ),
  Kpops(
    kpopID: 'G7',
    kpopname: 'GOT7',
    img: 'https://pbs.twimg.com/media/DddCKRgV4AAp8AA.jpg',
    detail: '\r\r\r\r\rก็อตเซเวน (อังกฤษ: GOT7; เกาหลี: 갓세븐) เป็นกลุ่มศิลปินดนตรีชายจากเกาหลีใต้ สังกัดค่ายเจวายพีเอนเตอร์เทนเมนต์ ประกอบไปด้วยสมาชิกจำนวน 7 คน คือ เจบี, มาร์ก, แจ็กสัน, จินย็อง, ย็องแจ, แบมแบม และยูกย็อม เปิดตัวครั้งแรกในวันที่ 16 มกราคม พ.ศ. 2557 กับอีพีชื่อ Got it ? ซึ่งขึ้นสูงสุดที่อันดับที่ 2 บน กาออนอัลบั้มชาร์ต และอันดับที่ 1 บนชาร์ต บิลบอร์ด เวิลด์อัลบั้มชาร์ต กลุ่มได้รับความสนใจจากการแสดงบนเวทีของพวกเขา ซึ่งรวมถึงองค์ประกอบศิลปะการต่อสู้แบบทริกกิง (martial arts tricking) ที่ทำให้กลุ่มกลายเป็นที่รู้จัก',
    color1: '0xFF7FFF00',
    color2: '0xFFFFFFFF'
  ),
  Kpops(
    kpopID: 'TW',
    kpopname: 'TWICE',
    img: 'https://s.isanook.com/jo/0/ui/483/2416873/20190923_23.jpg',
    detail: '\r\r\r\r\rทไวซ์ (อังกฤษ: Twice; เกาหลี: 트와이스; ญี่ปุ่น: トゥワイス) เป็นกลุ่มดนตรีเคป็อปหญิงล้วนคละสัญชาติ ซึ่งบริษัทเจวายพีเอนเตอร์เทนเมนต์จัดตั้งขึ้นเมื่อปี 2015 ผ่านรีแอลลิตีโชว์ชื่อ ซิกซ์ทีน โดยคัดสรรจากคณะนักแสดงฝึกหัดสิบหกคนของบริษัท ปัจจุบันมีสมาชิกเก้าคน ห้าคนเป็นชาวเกาหลีใต้ สามคนเป็นชาวญี่ปุ่น อีกหนึ่งคนเป็นชาวไต้หวัน ส่วนชื่อกลุ่มซึ่งแปลว่า สองครั้ง นั้นสื่อความหมายว่า ผู้ชมย่อมได้รับความประทับใจจากกลุ่มถึงสองหน คือ ประทับใจเมื่อได้ยิน และประทับใจเมื่อได้ยล \n\r\r\r\r\rทไวซ์เปิดตัวเมื่อวันที่ 20 ตุลาคม 2015 พร้อมเอกซ์เทนเดดเพลย์ชื่อ เดอะสตอรีบีกินส์ ในปลายปีนั้นเอง แม้เปิดตัวมาได้เพียงเดือนกว่า ทไวซ์ก็ได้รับรางวัลสำคัญ เป็นต้นว่า เอ็มเน็ตเอเชียนมิวสิกอะวอดส์สำหรับศิลปินหญิงหน้าใหม่ยอดเยี่ยม และซิมพลีเคป็อปอะวอดส์สำหรับกลุ่มศิลปินหญิงดาวรุ่งยอดเยี่ยม',
    color1: '0xFFFCC89B',
    color2: '0xFFFF5FA2'
  ),
  Kpops(
    kpopID: 'ST',
    kpopname: 'SISTAR',
    img: 'https://static.trueplookpanya.com/tppy/member/m_545000_547500/545920/cms/images/sistar-profile-5.jpg',
    detail: '\r\r\r\r\rซิสตาร์ (เกาหลี: 씨스타; อังกฤษ: Sistar, มักเขียน SISTAR) เป็นกลุ่มนักร้องหญิงของประเทศเกาหลีใต้ สังกัดค่ายสตาร์ชิพเอนเตอร์เทนเมนต์ ประกอบไปด้วยสมาชิกจำนวนสี่คนคือ ฮโยลิน, โบรา, โซยู และดาซม ประสบความสำเร็จกับอัลบั้มเปิดตัวของกลุ่ม โซคูล ในเดือนสิงหาคม ค.ศ. 2011 โดยซิสตาร์มีเพลงที่ขึ้นอันดับหนึ่งบนแกออนชาร์ต 9 เพลงติดต่อกัน ตั้งแต่ปี 2011–2017 โดยมีเพลงยอดนิยมหลายเพลง เช่น "เลิฟวิ่งยู" "กิฟอิตทูมี" "ทัชมายบอดี้" โดยเฉพาะ "โซคูล" ซึ่งประสบความสำเร็จด้านยอดขาย มียอดดิจิทัลดาวน์โหลดมากกว่า 3 ล้าน และยอดสตรีมมิงเกิน 18 ล้านครั้ง ในปี ค.ศ. 2011 กลายเป็นเพลงอันดับที่ 26 ที่ขายดีที่สุดในเกาหลีใต้และเดบิวต์ในอันดับหนึ่งของชาร์ตบิลบอร์ดเพลงเกาหลี 100 อันดับยอดนิยม ก่อนจะประสบความสำเร็จอย่างต่อเนื่องในเพลง "อะโลน" ที่ทำให้กลุ่มคว้ารางวัลเอ็มเน็ตเอเชียนมิวสิกอะวอดส์สาขาศิลปินกลุ่มหญิงยอดเยี่ยมปี 2012 \n\r\r\r\r\rในเดือนพฤษภาคม ค.ศ. 2017 ซิสตาร์ประกาศยุบวงหลังจากเซ็นสัญญา 7 ปีในฐานะสมาชิกกลุ่ม โดยปล่อยเพลง "โลนลี" เป็นครั้งสุดท้าย และจะสิ้นสุดหลังกิจกรรมของกลุ่มจบลง',
    color1: '0xFF62E0F0',
    color2: '0xFF0100AA'
  )
];

const DUMMY_MEMBER = const [
  Member(
    memberID: 'G1',
    fullname: 'Kim Jisoo',
    name: 'JISOO',
    kpopID: 'BP',
    img: 'https://187436-553851-1-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2018/11/BLACKPINK_Jisoo_Square_Up_Teaser_Image_3.png',
    histories: '\r\r\r\r\rคิม จี-ซู (เกาหลี: 김지수; เกิด 3 มกราคม ค.ศ. 1995) เป็นที่รู้จักในชื่อ จีซู เป็นนักร้องชาวเกาหลีใต้ รู้จักกันในฐานะสมาชิกวงดนตรีเคป็อปจากเกาหลีใต้ แบล็กพิงก์ ในปี ค.ศ. 2016 ที่ก่อตั้งขึ้นโดยวายจีเอ็นเตอร์เทนเมนต์',
    gallery: [
      'https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/20190106_%28NEWSEN%29_%EB%B8%94%EB%9E%99%ED%95%91%ED%81%AC%28BLACKPINK%29%2C_%EC%88%98%EC%A4%8D%EC%9D%80_%EB%A7%8E%EC%9D%80_%EC%86%8C%EB%85%80%EC%A7%80%EB%A7%8C_%EB%8F%8B%EB%B3%B4%EC%9D%B4%EB%8A%94_%EC%95%84%EB%A6%84%EB%8B%A4%EC%9A%B4_%EB%AF%B8%EB%AA%A8_%28Golden_Disc_Awards_2019%29_%286%29.jpg/720px-20190106_%28NEWSEN%29_%EB%B8%94%EB%9E%99%ED%95%91%ED%81%AC%28BLACKPINK%29%2C_%EC%88%98%EC%A4%8D%EC%9D%80_%EB%A7%8E%EC%9D%80_%EC%86%8C%EB%85%80%EC%A7%80%EB%A7%8C_%EB%8F%8B%EB%B3%B4%EC%9D%B4%EB%8A%94_%EC%95%84%EB%A6%84%EB%8B%A4%EC%9A%B4_%EB%AF%B8%EB%AA%A8_%28Golden_Disc_Awards_2019%29_%286%29.jpg',
      'http://www.popcornfor2.com/upload/115/news-full-114801.jpeg',
      'https://www.allkpop.com/upload/2019/08/content/190811/1566216698-7-blackpink-jisoo-dior-pop-up-store-event-19-august-2019.jpg',
      'https://i.pinimg.com/originals/f8/ed/bb/f8edbbd14a5a487bf9e84936e65ace93.jpg',
      'https://qph.fs.quoracdn.net/main-qimg-b7a43b48022504361b91b5212be11aeb',
      'https://sites.google.com/a/samakkhi.ac.th/lisa-blackpink/_/rsrc/1549724574972/sma-chikh-blackpink/kim-jisoo/7ee070a7eaa5604b76f40a11999a2a73.jpg?height=320&width=213',
      'http://www.walakatah.com/wp-content/uploads/2019/04/jisoo.png',
      'http://www.walakatah.com/wp-content/uploads/2019/04/5.png'
    ]
  ),
  Member(
    memberID: 'G2',
    fullname: 'Jennie Kim',
    name: 'JENNIE',
    kpopID: 'BP',
    img: 'https://187436-553851-1-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2018/11/BLACKPINK_Jennie_Square_Up_Teaser_Image_3.png',
    histories: '\r\r\r\r\rเจนนี คิม (เกาหลี: 김제니; เกิด 16 มกราคม ค.ศ. 1996) เป็นที่รู้จักในชื่อ เจนนี เป็นนักร้องชาวเกาหลีใต้ รู้จักกันในฐานะสมาชิกวงเกิร์ลกรุป แบล็กพิงก์'
  ),
  Member(
    memberID: 'G3',
    fullname: 'Roseanne Park',
    name: 'ROSE',
    kpopID: 'BP',
    img: 'https://187436-553851-1-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2018/11/BLACKPINK_Ros%C3%A9_Square_Up_Teaser_Image_3.png',
    histories: '\r\r\r\r\rโรแซนเน พัก หรือ พัก แช-ย็อง (เกาหลี: 박채영; เกิด 11 กุมภาพันธ์ ค.ศ. 1997) หรือชื่อในวงการคือ โรเซ (Rosé) เป็นนักร้องชาวเกาหลีใต้ที่เกิดในนิวซีแลนด์ รู้จักกันในฐานะนักร้องเสียงหลักของวงดนตรีเคป็อป แบล็กพิงก์'
  ),
  Member(
    memberID: 'G4',
    fullname: 'Lalisa Manoban',
    name: 'LISA',
    kpopID: 'BP',
    img: 'https://187436-553851-1-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2018/11/BLACKPINK_Lisa_Square_Up_Teaser_Image_3.png',
    histories: '\r\r\r\r\rลลิษา มโนบาล ชื่อเดิม ปราณปรียา มโนบาล (เกิด 27 มีนาคม พ.ศ. 2540) ชื่อในวงการเพลงว่า ลิซ่า[2] เป็นนักร้องชาวไทย รู้จักกันในฐานะสมาชิกเกิร์ลกรุ๊ปเกาหลีใต้ แบล็กพิงก์'
  ),
  Member(
    memberID: 'B1',
    fullname: 'Mark Tuan',
    name: 'MARK',
    kpopID: 'G7',
    img: 'http://az879543.vo.msecnd.net/got7/28_20200420_s.jpg',
    histories: '\r\r\r\r\rมาร์ก ต้วน (อักษรโรมัน: Mark Tuan; ฮันกึล: 마크) ชื่อเล่น "มาร์ก" เกิดวันที่ 4 กันยายน ค.ศ 1993 เป็นนักร้อง นักเต้น นักเเต่งเพลง สัญชาติอเมริกัน-ไต้หวัน เป็นหนึ่งในสมาชิกวงก็อตเซเวน ประเทศเกาหลีใต้ เริ่มเข้าสู่วงการบันเทิงตั้งแต่ พ.ศ. 2557 มีความสามารถพิเศษด้านศิลปะการต่อสู้'
  ),
  Member(
    memberID: 'B2',
    fullname: 'Lim Jae-Beom',
    name: 'JB',
    kpopID: 'G7',
    img: 'http://az879543.vo.msecnd.net/got7/27_20200420_s.jpg',
    histories: '\r\r\r\r\rอิม แจ-บ็อม (อักษรโรมัน: Lim Jae-Beom; เกิดเมื่อวันที่ 6 มกราคม ค.ศ. 1994) หรือที่รู้จักกันในนาม เจบี (JB) เป็นศิลปิน นักแต่งเพลง นักเต้น และนักแสดงชาวเกาหลีใต้ ก่อนหน้านี้เขาเป็นที่รู้จักในสถานะสมาชิกดูโอวง "เจเจโปรเจกต์" ร่วมกับจินย็อง ปัจจุบันแจบ็อมเป็นหัวหน้าวงก็อตเซเวน ทั้งเจเจโปรเจกต์และก็อตเซเวนอยู่ในสังกัดเจวายพีเอนเตอร์เทนเมนต์'
  ),
  Member(
    memberID: 'B3',
    fullname: 'Jackson Wang',
    name: 'JACKSON',
    kpopID: 'G7',
    img: 'http://az879543.vo.msecnd.net/got7/29_20200420_s.jpg',
    histories: '\r\r\r\r\rแจ็กสัน หวัง (จีน: 王嘉爾, เกาหลี: 왕잭슨; เกิด 28 มีนาคม ค.ศ. 1994) เป็นแร็ปเปอร์ นักร้อง นักแต่งเพลง และนักเต้นชาวฮ่องกง โดยเป็นสมาชิกก็อตเซเวน บอยแบนด์เกาหลีใต้ในสังกัดเจวายพีเอนเตอร์เทนเมนต์ และได้ก่อตั้งบริษัทชื่อทีมหวัง (Team Wang) เพื่อดูแลงานเดี่ยวที่ประเทศจีนและต่างประเทศทั้งหมด และเขายังมีบทบาทในรายการทีวีอีกมากมายทั้งในเกาหลีใต้และจีน'
  ),
  Member(
    memberID: 'B4',
    fullname: 'Park Jin-young',
    name: 'JINYOUNG',
    kpopID: 'G7',
    img: 'http://az879543.vo.msecnd.net/got7/30_20200420_s.jpg',
    histories: '\r\r\r\r\rพัก จิน-ย็อง (เกาหลี: 박진영; เกิด 22 กันยายน ค.ศ. 1994) เป็นที่รู้จักในชื่อ จินย็อง เป็นนักร้องและนักแสดงชาวเกาหลีใต้ เขาเป็นสมาชิกของวงเจเจโพรเจกต์ และกลุ่ม ก็อตเซเวน ภายใต้สังกัดเจวายพีเอนเตอร์เทนเมนต์ พักเริ่มงานแสดงครั้งแรกในละครเรื่อง ทะยานสู่ฝัน บัลลังก์แห่งดาว 2 (2012) ตามมาด้วยการรับบทสนับสนุนในละครเรื่อง เพื่อรัก เพื่อฝัน เพื่อวันวาน (2013) และ อึนดงยอดรัก (2015) เขายังได้แสดงภาพยนตร์อิสระเรื่อง A Stray Goat (2017)\n\r\r\r\r\rเดิมทีจินย็องใช้ชื่อในวงการว่า จูเนียร์ (ใช้เป็นตัวย่อว่า Jr.) เนื่องจากชื่อจริงของเขาซ้ำกับผู้ก่อตั้งเจวายพีเอนเตอร์เทนเมนต์ ในวันที่ 5 พฤษภาคม ค.ศ. 2015 เขาเปลี่ยนชื่อเป็น จูเนียร์ (Junior) เนื่องจากแฟน ๆ เริ่มสับสนชื่อของเขากับเจบี และสื่อต่าง ๆ มักถามเกี่ยวกับออกเสียงที่ถูกต้อง และเมื่อวันที่ 16 สิงหาคม ค.ศ. 2016 มีการประกาศอย่างเป็นทางการว่า เขาจะกลับไปชื่อของเขา พัก จิน-ย็อง'
  ),
  Member(
    memberID: 'B5',
    fullname: 'Choi Young-jae',
    name: 'YOUNGJAE',
    kpopID: 'G7',
    img: 'http://az879543.vo.msecnd.net/got7/31_20200420_s.jpg',
    histories: '\r\r\r\r\rชเว ย็อง-แจ (อังกฤษ: Choi Young-jae; ฮันกึล: 최영재; เกิด 17 กันยายน 2539) หรือที่รู้จักกันในนาม ย็อง-แจ เป็นนักร้อง และนักเต้นชาวเกาหลีใต้ ปัจจุบันย็องแจเป็นนักร้องนำวงก็อตเซเวน อยู่ในสังกัดเจวายพีเอนเตอร์เทนเมนต์'
  ),
  Member(
    memberID: 'B6',
    fullname: 'Kunpimook Bhuwakul',
    name: 'BAMBAM',
    kpopID: 'G7',
    img: 'http://az879543.vo.msecnd.net/got7/32_20200420_s.jpg',
    histories: '\r\r\r\r\rกันต์พิมุกต์ ภูวกุล หรือรู้จักในชื่อเล่นว่า แบมแบม (ฮันกึล: 뱀뱀) (เกิด 2 พฤษภาคม พ.ศ. 2540) เป็นนักร้องสัญชาติไทยคนที่สองในค่ายเจวายพีเอนเตอร์เทนเมนต์ ประเทศเกาหลีใต้ โดยคนแรกคือ นิชคุณ หรเวชกุล'
  ),
  Member(
    memberID: 'B7',
    fullname: 'Kim Yugyeom',
    name: 'YUGYEOM',
    kpopID: 'G7',
    img: 'http://az879543.vo.msecnd.net/got7/33_20200420_s.jpg',
    histories: '\r\r\r\r\rคิม ยู-กย็อม (อังกฤษ: Kim Yugyeom; ฮันกึล: 김유겸; ฮันจา: 金有兼; เกิด 17 พฤศจิกายน 2540) หรือที่รู้จักกันในนาม ยู-กย็อม เป็นนักร้อง และนักเต้นชาวเกาหลีใต้ ปัจจุบันยู-กย็อมเป็นนักร้องวงก็อตเซเวน อยู่ในสังกัดเจวายพีเอนเตอร์เทนเมนต์ และกลุ่มย่อยจัสทู'
  ),
  Member(
    memberID: 'G5',
    fullname: 'Yoon Bo-ra',
    name: 'BORA',
    kpopID: 'ST',
    img: 'https://image.dek-d.com/26//110683333',
    histories: '\r\r\r\r\rยุน โบ-รา (อักษรโรมัน: Yoon Bora; เกิด 30 ธันวาคม พ.ศ. 2532) หรือชื่อในการแสดงว่า โบรา เป็นนักร้อง นักแสดง พิธีกรชาวเกาหลีใต้ รู้จักในสถานะสมาชิกวง ซิสต้าร์'
  ),
  Member(
    memberID: 'G6',
    fullname: 'Kim Hyo-jung',
    name: 'HYOLYN',
    kpopID: 'ST',
    img: 'https://image.dek-d.com/26//110683327',
    histories: '\r\r\r\r\rคิม ฮโย-จ็อง (เกาหลี: 김효정 เกิด 11 มกราคม พ.ศ. 2534) เป็นที่รู้จักในชื่อ ฮโยลิน เป็นนักร้องชาวเกาหลีใต้ เธอเป็นที่รู้จักในฐานะสมาชิกวงเกิร์ลกรุปจากเกาหลีใต้ ซิสตาร์และกลุ่มย่อยซิสตาร์19'
  ),
  Member(
    memberID: 'G7',
    fullname: 'Kang Ji-hyun',
    name: 'SOYOU',
    kpopID: 'ST',
    img: 'https://image.dek-d.com/26//110683334',
    histories: '\r\r\r\r\rคัง จี-ฮย็อน (เกาหลี: 강지현; เกิด 12 กุมภาพันธ์ พ.ศ. 2535) หรือชื่อที่ในวงการคือ โซยู (소유) เป็นนักร้องชาวเกาหลีใต้ รู้จักกันในฐานะนักร้องนำของวงดนตรีเคป็อปจากเกาหลีใต้ ซิสตาร์ ที่ก่อตั้งโดยค่ายสตาร์ชิพเอนเตอร์เทนเมนต์'
  ),
  Member(
    memberID: 'G8',
    fullname: 'Kim Da-som',
    name: 'DASOM',
    kpopID: 'ST',
    img: 'https://image.dek-d.com/26//110683337',
    histories: '\r\r\r\r\rคิม ดา-ซม (อักษรโรมัน: Kim Dasom; เกิด 6 พฤษภาคม พ.ศ. 2536) หรือชื่อในการแสดงว่า ดาซม เป็นนักร้อง นักร้อง พิธีกร ชาวเกาหลีใต้รู้จักในสถานะสมาชิกวง ซิสตาร์'
  ),
  Member(
    memberID: 'G9',
    fullname: 'Im Na-yeon',
    name: 'NAYEON',
    kpopID: 'TW',
    img: 'https://www.leerath.com/wp-content/uploads/2019/08/twice-%e0%b8%aa%e0%b8%a1%e0%b8%b2%e0%b8%8a%e0%b8%b4%e0%b8%81-%e0%b8%9b%e0%b8%a3%e0%b8%b0%e0%b8%a7%e0%b8%b1%e0%b8%95%e0%b8%b4-Nayeon-%e0%b8%99%e0%b8%b2%e0%b8%a2%e0%b8%ad%e0%b8%99-768x758.jpg',
    histories: '\r\r\r\r\rอิม นา-ยอน (เกาหลี: 임나연; เกิด 22 กันยายน 1995) เป็นที่รู้จักในชื่อ นา-ยอน เป็นนักร้องเคป็อปและนักแสดงหญิงชาวเกาหลีใต้ ทั้งเป็นสมาชิกทไวซ์ (Twice) กลุ่มดนตรีหญิงซึ่งบริษัทเจวายพีเอนเตอร์เทนเมนต์ (JYP Entertainment) จัดตั้งขึ้นในเกาหลีใต้เมื่อปี 2015 ผ่านรายการรีแอลลิตีโชว์ชื่อ ซิกซ์ทีน (Sixteen)'
  ),
  Member(
    memberID: 'G10',
    fullname: 'Yoo Jeong-yeon',
    name: 'JEONGYEON',
    kpopID: 'TW',
    img: 'https://www.leerath.com/wp-content/uploads/2019/08/twice-%E0%B8%AA%E0%B8%A1%E0%B8%B2%E0%B8%8A%E0%B8%B4%E0%B8%81-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4-Jeongyeon-%E0%B8%88%E0%B8%AD%E0%B8%87%E0%B8%A2%E0%B8%AD%E0%B8%99.jpg',
    histories: '\r\r\r\r\rยู จ็อง-ย็อน (เกาหลี: 유정연; เกิด 1 มกราคม 1996) เป็นที่รู้จักในชื่อ จ็อง-ย็อน เป็นนักร้องเคป็อปและนักแสดงหญิงชาวเกาหลีใต้ ทั้งเป็นสมาชิกทไวซ์ (Twice) กลุ่มดนตรีหญิงซึ่งบริษัทเจวายพีเอนเตอร์เทนเมนต์ (JYP Entertainment) จัดตั้งขึ้นในเกาหลีใต้เมื่อปี 2015 ผ่านรายการรีแอลลิตีโชว์ชื่อ ซิกซ์ทีน (Sixteen)'
  ),
  Member(
    memberID: 'G11',
    fullname: 'Hirai Momo',
    name: 'MOMO',
    kpopID: 'TW',
    img: 'https://www.leerath.com/wp-content/uploads/2019/08/twice-%E0%B8%AA%E0%B8%A1%E0%B8%B2%E0%B8%8A%E0%B8%B4%E0%B8%81-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4-%E0%B9%82%E0%B8%A1%E0%B9%82%E0%B8%A1%E0%B8%B0-MOMO.jpg',
    histories: '\r\r\r\r\rโมโมะ ฮิราอิ (ญี่ปุ่น: 平井 もも Hirai Momo;[1] เกิดวันที่ 9 พฤศจิกายน ค.ศ. 1996) เป็นที่รู้จักในชื่อ โมโมะ เป็นนักร้องเคป็อปชาวญี่ปุ่น ทั้งเป็นสมาชิกทไวซ์ (Twice) กลุ่มดนตรีหญิงซึ่งบริษัทเจวายพีเอนเตอร์เทนเมนต์ (JYP Entertainment) จัดตั้งขึ้นในเกาหลีใต้เมื่อปี 2015 ผ่านรายการรีแอลลิตีโชว์ชื่อ ซิกซ์ทีน (Sixteen)'
  ),
  Member(
    memberID: 'G12',
    fullname: 'Minatozaki Sana',
    name: 'SANA',
    kpopID: 'TW',
    img: 'https://www.leerath.com/wp-content/uploads/2019/08/twice-%E0%B8%AA%E0%B8%A1%E0%B8%B2%E0%B8%8A%E0%B8%B4%E0%B8%81-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4-Sana-%E0%B8%8B%E0%B8%B2%E0%B8%99%E0%B8%B0.jpg',
    histories: '\r\r\r\r\rซานะ มินาโตซากิ (ญี่ปุ่น: Sana Minatozaki โรมาจิ: 湊崎紗夏 ทับศัพท์: Minatozaki Sana, เกิด 29 ธันวาคม ค.ศ. 1996 (พ.ศ.2539)) รู้จักกันในชื่อทั่วไปว่า ซานะ เป็นนักร้องชาวญี่ปุ่นที่พำนักอยู่ในเกาหลีใต้ เธอเปิดตัวเมื่อปี 2015 ในฐานะสมาชิกเกิร์ลกรุป ทไวซ์ ในสังกัดเจวายพีเอนเตอร์เทนเมนต์'
  ),
  Member(
    memberID: 'G13',
    fullname: 'Park Ji-hyo',
    name: 'JIHYO',
    kpopID: 'TW',
    img: 'https://www.leerath.com/wp-content/uploads/2019/08/twice-%E0%B8%AA%E0%B8%A1%E0%B8%B2%E0%B8%8A%E0%B8%B4%E0%B8%81-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4-%E0%B8%88%E0%B8%B5%E0%B8%AE%E0%B9%82%E0%B8%A2-Jihyo.jpg',
    histories: '\r\r\r\r\rพัก จี-ฮโย (เกาหลี: 박지효[1]; เกิด 1 กุมภาพันธ์ ค.ศ. 1997) หรือชื่อในวงการว่า จี-ฮโย เป็นนักร้องเคป็อปชาวเกาหลีใต้ ทั้งเป็นสมาชิกทไวซ์ (Twice) กลุ่มดนตรีหญิงซึ่งบริษัทเจวายพีเอนเตอร์เทนเมนต์ (JYP Entertainment) จัดตั้งขึ้นในเกาหลีใต้เมื่อปี 2015 ผ่านรายการรีแอลลิตีโชว์ชื่อ ซิกซ์ทีน (Sixteen)'
  ),
  Member(
    memberID: 'G14',
    fullname: 'Myoui Mina',
    name: 'MINA',
    kpopID: 'TW',
    img: 'https://www.leerath.com/wp-content/uploads/2019/08/twice-%E0%B8%AA%E0%B8%A1%E0%B8%B2%E0%B8%8A%E0%B8%B4%E0%B8%81-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4-mina-%E0%B8%A1%E0%B8%B4%E0%B8%99%E0%B8%B0.jpg',
    histories: '\r\r\r\r\rมินะ (ฮันกึล : 묘이 미나, ญี่ปุ่น : 名井 南(มินะ ชารอน เมียวอิ) เกิดเมื่อวันจันทร์ที่ 24 มีนาคม 2540 นักร้องญี่ปุ่นในฐานะนักร้องเคป็อป เกิร์ลกรุ๊ป ทไวซ์ แห่งค่ายเจวายพีเอนเตอร์เทนเมนต์ ตำแหน่งนักร้องนักเต้นหลัก'
  ),
  Member(
    memberID: 'G15',
    fullname: 'Kim Dahyun',
    name: 'DAHYUN',
    kpopID: 'TW',
    img: 'https://www.leerath.com/wp-content/uploads/2019/08/twice-%E0%B8%AA%E0%B8%A1%E0%B8%B2%E0%B8%8A%E0%B8%B4%E0%B8%81-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4-%E0%B8%94%E0%B8%B2%E0%B8%AE%E0%B8%A2%E0%B8%AD%E0%B8%99-DaHyun.jpg',
    histories: '\r\r\r\r\rคิม ดา-ฮย็อน (เกาหลี: 김다현[1]; เกิด 28 พฤษภาคม ค.ศ. 1998) เป็นที่รู้จักในชื่อ ดา-ฮย็อน เป็นนักร้องเคป็อปชาวเกาหลีใต้ ทั้งเป็นสมาชิกทไวซ์ (Twice) กลุ่มดนตรีหญิงซึ่งบริษัทเจวายพีเอนเตอร์เทนเมนต์ (JYP Entertainment) จัดตั้งขึ้นในเกาหลีใต้เมื่อปี 2015 ผ่านรายการรีแอลลิตีโชว์ชื่อ ซิกซ์ทีน (Sixteen)'
  ),
  Member(
    memberID: 'G16',
    fullname: 'Son Chae-young',
    name: 'CHAEYOUNG',
    kpopID: 'TW',
    img: 'https://www.leerath.com/wp-content/uploads/2019/08/twice-%E0%B8%AA%E0%B8%A1%E0%B8%B2%E0%B8%8A%E0%B8%B4%E0%B8%81-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4-chae-young-%E0%B9%81%E0%B8%8A%E0%B8%A2%E0%B8%AD%E0%B8%87.jpg',
    histories: '\r\r\r\r\rซน แช-ย็อง (เกาหลี: 손채영; เกิด 23 เมษายน 1999) เป็นที่รู้จักในชื่อ แช-ย็อง เป็นนักร้องเคป็อปชาวเกาหลีใต้ ทั้งเป็นสมาชิกทไวซ์ (Twice) กลุ่มดนตรีหญิงซึ่งบริษัทเจวายพีเอนเตอร์เทนเมนต์ (JYP Entertainment) จัดตั้งขึ้นในเกาหลีใต้เมื่อปี 2015 ผ่านรายการรีแอลลิตีโชว์ชื่อ ซิกซ์ทีน (Sixteen)'
  ),
  Member(
    memberID: 'G17',
    fullname: 'Chou Tzu-yu',
    name: 'TZUYU',
    kpopID: 'TW',
    img: 'https://www.leerath.com/wp-content/uploads/2019/08/twice-%E0%B8%AA%E0%B8%A1%E0%B8%B2%E0%B8%8A%E0%B8%B4%E0%B8%81-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4-%E0%B8%88%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%A7%E0%B8%B5%E0%B9%88-Tzuyu.jpg',
    histories: '\r\r\r\r\rโจว จื่อ-ยฺหวี (จีน: 周子瑜; พินอิน: Zhōu Zǐyú; อักษรโรมัน: Chou Tzu-yu; เกิด 14 มิถุนายน 1999) ชื่อในการแสดงว่า จื่อ-ยฺหวี (Tzuyu) เป็นนักร้องเคป็อปชาวไต้หวัน ทั้งเป็นสมาชิกทไวซ์ (Twice) กลุ่มดนตรีหญิงซึ่งบริษัทเจวายพีเอนเตอร์เทนเมนต์ (JYP Entertainment) จัดตั้งขึ้นในเกาหลีใต้เมื่อปี 2015 ผ่านรายการรีแอลลิตีโชว์ชื่อ ซิกซ์ทีน (Sixteen)\n\r\r\r\r\rเดือนมกราคม 2016 มีการเผยแพร่ภาพจื่อ-ยฺหวี ถือธงชาติไต้หวัน ทางอินเทอร์เน็ต พร้อมกล่าวหาว่า จื่อ-ยฺหวี สนับสนุนให้ไต้หวันแยกตัวเป็นเอกราชจากจีน เป็นเหตุให้ชาวจีนเดือดดาล ครั้นวันที่ 15 มกราคม 2016 เจวายพีเอนเตอร์เทนเมนต์ให้จื่อ-ยฺหวี ออกวีดิทัศน์ขอขมา เชื่อกันว่า ข้อกล่าวหาจื่อ-ยฺหวี นั้นเป็นไปเพื่อให้มีผลต่อความคิดของสาธารณชนในการเลือกตั้งประธานาธิบดีอันจะมีขึ้นในวันถัดมา ผู้มีสิทธิเลือกตั้งบางคนระบุว่า เดิมสนับสนุนพรรคประชาธิปไตยก้าวหน้า (民主進步黨) ซึ่งชูนโยบายหนุนเอกราชไต้หวัน ก็ต้องทบทวนความคิดใหม่หลังเกิดเหตุการณ์ของจื่อ-ยฺหวี อย่างไรก็ดี ครั้นมีการเลือกตั้งแล้ว ปรากฏว่า พรรคประชาธิปไตยก้าวหน้ายังคงได้คะแนนเสียงท่วมท้น ส่งผลให้ผู้สมัครจากพรรคได้เป็นประธานาธิบดีหญิงคนแรกในประวัติศาสตร์'
  ),
];